https://github.com/jkitchin/scimax/issues/68

Text before a section behaves as expected.

Giving a new paragraph after an empty line.

* New section
After a section, however, blank lines seem to get stripped.

New paragraph should be begin here.

But it doesn't.

#+BEGIN_SRC ipython :session :results output drawer
6
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

** Workarounds

New paragraphs can be forced
<p>

With an html ~<p>~ or
\\
a double backslash at beginning of line.


A line by itself.

After an empty line.

#+ipynb-newcell

and more...
*** Subsubsection
Markdown conversion is losing depth in sections.

All sections are first level headings in ipynb markdown cells.

* the level problem                                                :noexport:

#+BEGIN_SRC emacs-lisp
(require 'ox-md)
#+END_SRC

This block shows that org does not respect the heading level.
#+BEGIN_SRC emacs-lisp
(s-trim
		(org-export-string-as
		 "** test"
		 'md t '(:with-toc nil :with-tags nil)))
#+END_SRC

#+RESULTS:
: # test

This used to work for me to retain the heading levels.

#+BEGIN_SRC emacs-lisp
(cl-flet ((org-export-get-relative-level
			(headline info)
			(org-element-property :level headline)))
	       (s-trim
		(org-export-string-as
		 "*** test"
		 'md t '(:with-toc nil :with-tags nil))))
#+END_SRC

#+RESULTS:
: # test


Regular flet seems to work fine.


#+BEGIN_SRC emacs-lisp
(flet ((org-export-get-relative-level
			(headline info)
			(org-element-property :level headline)))
	       (s-trim
		(org-export-string-as
		 "*** test"
		 'md t '(:with-toc nil :with-tags nil))))
#+END_SRC

#+RESULTS:
: ### test

It looks like this is the current right way to do this.
#+BEGIN_SRC emacs-lisp
(cl-letf (((symbol-function 'org-export-get-relative-level)
           (lambda (headline info) (org-element-property :level headline))))
  (s-trim
   (org-export-string-as
    "*** test"
    'md t '(:with-toc nil :with-tags nil))))
#+END_SRC

#+RESULTS:
: ### test
